In [4]:
### We now want to transform time series data into the required features, so that we are able to get the features and targets for each sample in the dataframe

In [ ]:
import pandas as pd
from typing import Optional, List

In [3]:
ts_data = pd.read_parquet('../data/transformed/ts_data_2022_01.parquet')
ts_data.head(5)

          pickup_hour  rides  pickup_location_id
0 2022-01-01 00:00:00     11                   4
1 2022-01-01 01:00:00     15                   4
2 2022-01-01 02:00:00     26                   4
3 2022-01-01 03:00:00      8                   4
4 2022-01-01 04:00:00      9                   4

In [8]:
ts_data_one_location = ts_data.loc[ts_data.pickup_location_id == 43,:].reset_index(drop=True)
ts_data_one_location.head(10)

          pickup_hour  rides  pickup_location_id
0 2022-01-01 00:00:00     97                  43
1 2022-01-01 01:00:00     60                  43
2 2022-01-01 02:00:00     22                  43
3 2022-01-01 03:00:00      8                  43
4 2022-01-01 04:00:00      6                  43
5 2022-01-01 05:00:00      5                  43
6 2022-01-01 06:00:00      3                  43
7 2022-01-01 07:00:00     10                  43
8 2022-01-01 08:00:00      7                  43
9 2022-01-01 09:00:00     19                  43

In [ ]:
def get_cutoff_indices(data: pd.DataFrame, n_features: int, step_size: int) -> List:
    """
    
    """
    stop_position = len(data) -1 

    ## start the first sub-sequence at index position 0
    subseq_first_idx = 0
    subseq_last_idx = n_features
    subseq_last_idx = n_features + 1 
    indices = []